Revit 2024 API
StructuralElementDefinitionData Constructor
 Creates empty StructuralElementDefinitionData object.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public StructuralElementDefinitionData()
Visual Basic
Public Sub New
Visual C++
public:
StructuralElementDefinitionData()
See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace